tests/performance/tmp/run345/inference_taurus_local_monitoring/merged.yml
---
execution:
- concurrency: 1
  hold-for: 20s
  ramp-up: 5s
  scenario: Inference
modules:
  jmeter:
    properties:
      hostname: 127.0.0.1
      input_filepath: kitten.jpg
      management_port: 8081
      port: 8080
      protocol: http
  server_local_monitoring:
    class: metrics_monitoring_taurus.Monitor
reporting:
- module: passfail
- data-source: pass-fail
  module: junit-xml
- data-source: sample-labels
  module: junit-xml
- dump-csv: ${BASEDIR}/final_stats.csv
  module: final-stats
scenarios:
  Inference:
    script: register_and_inference.jmx
services:
- ServerLocalClient:
  - interval: 1s
    metrics:
    - cpu
    - disk-space
    - mem
    - sum_workers_memory_percent
  module: server_local_monitoring
settings:
  env:
    BASEDIR: .